app/controllers/tunes_controller.rb

SELECT * FROM "tunes"
---
  def index
    @tunes = Tune.all

SELECT * FROM "tunes" WHERE ("tunes"."id" = 1)
---
  def show
    @tune = Tune.find(params[:id])

SELECT * FROM "tunes" WHERE ("tunes"."id" = 1)
---
  def edit
    @tune = Tune.find(params[:id])

INSERT INTO "tunes" ("name", "updated_at", "episode_count", "age", "created_at") VALUES('Tweety', '2010-04-27 23:31:17', 1000, 3, '2010-04-27 23:31:17')
---
  def create
    @tune = Tune.new(params[:tune])

    respond_to do |format|
      if @tune.save